#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/heder24/test-1/runs/run-b5SUA1rMuSQhdZ64

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
module.ec2.data.aws_ssm_parameter.this[0]: Refreshing...
module.ec2.data.aws_partition.current: Refreshing...
module.autoscaling.data.aws_partition.current: Refreshing...
module.autoscaling.data.aws_default_tags.current: Refreshing...
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0f02fa593e65858b6]
module.security-groups.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0b4fd7eb4d83ba548]
module.ec2.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.autoscaling.data.aws_default_tags.current: Refresh complete after 0s [id=aws]
module.autoscaling.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.autoscaling.aws_launch_template.this[0]: Refreshing state... [id=lt-0e06473c426ef0d3d]
module.ec2.data.aws_ssm_parameter.this[0]: Refresh complete after 0s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
module.ec2.aws_instance.this[0]: Refreshing state... [id=i-0f1c3c92579e83081]
module.autoscaling.aws_launch_template.this[0]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = true
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = "ipv4"
      + load_balancer_type                          = "application"
      + name                                        = (known after apply)
      + name_prefix                                 = (known after apply)
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0f02fa593e65858b6",
        ]
      + subnets                                     = (known after apply)
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.autoscaling.aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "prod-asg-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = "unknown"
          + name    = "prod-asg-20231102034626458000000003"
          + version = "1"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "prod-asg"
        }

      + timeouts {}
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @heder24, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*